app/Models/PegadaianModel.php

    public function getDataGadai()
    {
        return $this->db->table('pinjamangadai')
            ->join('nasabah', 'nasabah.id_nasabah = pinjamangadai.id_nasabah')
            ->join('cabang', 'cabang.kode_cabang = pinjamangadai.kode_cabang')
            ->get()->getResultObject();
---
SELECT *
FROM `pinjamangadai`
JOIN `nasabah` ON `nasabah`.`id_nasabah` = `pinjamangadai`.`id_nasabah`
JOIN `cabang` ON `cabang`.`kode_cabang` = `pinjamangadai`.`kode_cabang`