app/Models/PendapatanModel.php

SELECT SUM(`jumlah_untung`) AS `jumlah_untung`
FROM `pendapatan`
---
    public function getTotalPendapatan()
    {
        $builder = $this->selectSum('jumlah_untung');
        $data = $builder->get()->getResultArray();